СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ГрафикЛиквидацииЗадолженностей/ГрафикЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГрафикЛиквидацииЗадолженностей</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ГрафикПересдач</registerRecords>
  <attributes>
    <name>ДатаСоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныеГода</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>CatalogRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасписаниеПересдач</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИВремя</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Аудитория</name>
      <type>
        <types>CatalogRef.Аудитории</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.Преподаватели</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаКонтроля</name>
      <type>
        <types>EnumRef.НаименованиеКонтроля</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей/ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</name>
  <basedOn>Document.НаправлениеНаПересдачу</basedOn>
  <registerRecords>AccumulationRegister.НагрузкаКомиссий</registerRecords>
  <registerRecords>AccumulationRegister.НеявкиНаПересдачи</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныеГода</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>CatalogRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреподавательКомиссии</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </attributes>
  <attributes>
    <name>РольВКомиссии</name>
    <type>
      <types>EnumRef.РольВКомиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.НаправлениеНаПересдачу</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НазначениеСтудентаДляПреподавателя</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВида</name>
      <type>
        <types>EnumRef.НаименованиеВида</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПропусков</name>
      <type>
        <types>EnumRef.КоличествоПропусков</types>
      </type>
    </attributes>
    <attributes>
      <name>ПотерянныеЧасыПреподавателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

СистемаЛиквидацииАкадемическихЗадолженностей/src/Documents/ГрафикЛиквидацииЗадолженностей/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	  ФакультетОснование = Объект.ДокументОснование.Факультет;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.НазначениеСтудентаДляПреподавателя.(
		|		Студент КАК Студент
		|	) КАК НазначениеСтудентаДляПреподавателя,
		|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Дисциплина КАК Дисциплина,
		|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.ПреподавательКомиссии КАК Преподаватель
		|ИЗ
		|	Документ.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей КАК ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей
		|ГДЕ
		|	ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей.Факультет = &ФакультетОснование";
	
	Запрос.УстановитьПараметр("ФакультетОснование", ФакультетОснование);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ТаблицаСтудентов = РезультатЗапроса.Выгрузить();
		
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
			
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	НоваяСтр = Объект.РасписаниеПересдач.Добавить();
	//	//НоваяСтр.Студент = ВыборкаДетальныеЗаписи.Студент;  
	//	НоваяСтр.Дисциплина = ВыборкаДетальныеЗаписи.Дисциплина;
	//	НоваяСтр.Преподаватель = ВыборкаДетальныеЗаписи.Преподаватель;   
		
	//КонецЦикла;
КонецПроцедуры
